<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Task 11</title>
</head>
<body style="background-color: #fffbcc;"> <!-- Bright background -->
    <h1 style="color: #ff5733;">Task 11</h1> <!-- Bright orange text -->
    <h3 style="color: #3498db;">Name: Maryam Sharif</h3> <!-- Bright blue text -->
    <h3 style="color: #2ecc71;">Rollnumber: BSDSM-F23-038</h3> <!-- Bright green text -->
</body>
</html>

<div class="alert alert-block alert-info">
    Using <b>Python </b> v3.8.18
    <br>
    with <b>Jupyter </b> v7.4.9
</div>

# Libraries

In [1]:
import pandas as pd
import numpy as np
import pickle

from sklearn.svm import SVC
from sklearn.metrics import accuracy_score
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

# Data reading / loading

In [2]:

df = pd.read_csv("data.csv")
df

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,5/2/2014 0:00,NaN,3,NaN,1340,7912,1.5,12,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,5/2/2014 0:00,NaN,5,NaN,3650,9050,2.0,12,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,5/2/2014 0:00,342000.0000,3,NaN,1930,11947,1.0,12,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,5/2/2014 0:00,NaN,3,NaN,2000,8030,1.0,12,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,5/2/2014 0:00,550000.0000,4,NaN,1940,10500,1.0,12,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4595,7/9/2014 0:00,308166.6667,3,1.75,1510,6360,1.0,0,0,4,1510,0,1954,1979,501 N 143rd St,Seattle,WA 98133,USA
4596,7/9/2014 0:00,534333.3333,3,2.50,1460,7573,2.0,0,0,3,1460,0,1983,2009,14855 SE 10th Pl,Bellevue,WA 98007,USA
4597,7/9/2014 0:00,416904.1667,3,2.50,3010,7014,2.0,0,0,3,3010,0,2009,0,759 Ilwaco Pl NE,Renton,WA 98059,USA
4598,7/10/2014 0:00,203400.0000,4,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,Seattle,WA 98178,USA
4599,7/10/2014 0:00,220600.0000,3,2.50,1490,8102,2.0,0,0,4,1490,0,1990,0,18717 SE 258th St,Covington,WA 98042,USA

In [3]:
# print(df)

In [4]:
# pd.set_option("display.max_rows", None, "display.max_columns", None)
# df

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Data Exploration</title>
</head>
<body style="background-color: #fffbcc;"> <!-- Bright background -->
    <h1 style="color: #ff5733;">Data Exploration</h1> <!-- Bright orange text -->

</body>
</html>

</html>

In [3]:
# Data View
# df.head()
df.head(2)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,5/2/2014 0:00,NaN,3,NaN,1340,7912,1.5,12,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,5/2/2014 0:00,NaN,5,NaN,3650,9050,2.0,12,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA

In [4]:
# df.tail()
df.tail(2)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
4598,7/10/2014 0:00,203400.0,4,2.0,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,Seattle,WA 98178,USA
4599,7/10/2014 0:00,220600.0,3,2.5,1490,8102,2.0,0,0,4,1490,0,1990,0,18717 SE 258th St,Covington,WA 98042,USA

In [5]:
print(f"Number of rows {df.shape[0]}, Number of columns {df.shape[1]}")
print(df.shape)

Number of rows 4600, Number of columns 18
(4600, 18)

In [11]:
print("Attributes in Data".center(50, "-"))
for cols in df.columns:
    print(cols)

----------------Attributes in Data----------------
date
price
bedrooms
bathrooms
sqft_living
sqft_lot
floors
waterfront
view
condition
sqft_above
sqft_basement
yr_built
yr_renovated
street
city
statezip
country

In [12]:
print("Number of instances in Data".center(50, "-"))
print(df.count())

-----------Number of instances in Data------------
date             4600
price            4596
bedrooms         4600
bathrooms        4590
sqft_living      4600
sqft_lot         4600
floors           4600
waterfront       4600
view             4600
condition        4600
sqft_above       4600
sqft_basement    4600
yr_built         4600
yr_renovated     4600
street           4600
city             4600
statezip         4600
country          4600
dtype: int64

In [8]:
df['city'].unique()

array(['Shoreline', 'Seattle', 'Kent', 'Bellevue', 'Redmond',
       'Maple Valley', 'North Bend', 'Lake Forest Park', 'Sammamish',
       'Auburn', 'Des Moines', 'Bothell', 'Federal Way', 'Kirkland',
       'Issaquah', 'Woodinville', 'Normandy Park', 'Fall City', 'Renton',
       'Carnation', 'Snoqualmie', 'Duvall', 'Burien', 'Covington',
       'Inglewood-Finn Hill', 'Kenmore', 'Newcastle', 'Mercer Island',
       'Black Diamond', 'Ravensdale', 'Clyde Hill', 'Algona', 'Skykomish',
       'Tukwila', 'Vashon', 'Yarrow Point', 'SeaTac', 'Medina',
       'Enumclaw', 'Snoqualmie Pass', 'Pacific', 'Beaux Arts Village',
       'Preston', 'Milton'], dtype=object)

In [13]:
print("Number of Unique Values in Data".center(50, "-"))
print(df.nunique())

---------Number of Unique Values in Data----------
date               70
price            1740
bedrooms           10
bathrooms          26
sqft_living       566
sqft_lot         3113
floors              6
waterfront          3
view                7
condition           5
sqft_above        511
sqft_basement     207
yr_built          115
yr_renovated       60
street           4525
city               44
statezip           77
country             1
dtype: int64

In [14]:
print("Number of Null Values in Data".center(50, "-"))
print(df.isnull().sum())

----------Number of Null Values in Data-----------
date              0
price             4
bedrooms          0
bathrooms        10
sqft_living       0
sqft_lot          0
floors            0
waterfront        0
view              0
condition         0
sqft_above        0
sqft_basement     0
yr_built          0
yr_renovated      0
street            0
city              0
statezip          0
country           0
dtype: int64

In [15]:
print("Details of Data".center(50, "-"))
df.describe()

-----------------Details of Data------------------

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated
count,4.596000e+03,4600.000000,4590.000000,4600.000000,4.600000e+03,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000
mean,5.516586e+05,3.400870,2.153431,2139.346957,1.485252e+04,1.512065,0.033261,0.348261,3.451739,1827.265435,312.081522,1970.786304,808.608261
std,5.634170e+05,0.908848,0.794986,963.206916,3.588444e+04,0.538288,0.564961,1.943879,0.677230,862.168977,464.137228,29.731848,979.414536
min,0.000000e+00,0.000000,0.000000,370.000000,6.380000e+02,1.000000,0.000000,0.000000,1.000000,370.000000,0.000000,1900.000000,0.000000
25%,3.228750e+05,3.000000,1.750000,1460.000000,5.000750e+03,1.000000,0.000000,0.000000,3.000000,1190.000000,0.000000,1951.000000,0.000000
50%,4.609435e+05,3.000000,2.250000,1980.000000,7.683000e+03,1.500000,0.000000,0.000000,3.000000,1590.000000,0.000000,1976.000000,0.000000
75%,6.549625e+05,4.000000,2.500000,2620.000000,1.100125e+04,2.000000,0.000000,0.000000,4.000000,2300.000000,610.000000,1997.000000,1999.000000
max,2.659000e+07,9.000000,8.000000,13540.000000,1.074218e+06,3.500000,12.000000,33.000000,5.000000,9410.000000,4820.000000,2014.000000,2014.000000

In [16]:
print("Insights of Data".center(50,"-"))
df.info()

-----------------Insights of Data-----------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4596 non-null   float64
 2   bedrooms       4600 non-null   int64
 3   bathrooms      4590 non-null   float64
 4   sqft_living    4600 non-null   int64
 5   sqft_lot       4600 non-null   int64
 6   floors         4600 non-null   float64
 7   waterfront     4600 non-null   int64
 8   view           4600 non-null   int64
 9   condition      4600 non-null   int64
 10  sqft_above     4600 non-null   int64
 11  sqft_basement  4600 non-null   int64
 12  yr_built       4600 non-null   int64
 13  yr_renovated   4600 non-null   int64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: float64(3), int64(10), object(5)
memory usage: 647.0+ KB

# Data Pre-Processing

### Manage Null-Values

In [17]:
print("Number of Null Values in Data".center(50, "-"))
print(df.isnull().sum())

----------Number of Null Values in Data-----------
date              0
price             4
bedrooms          0
bathrooms        10
sqft_living       0
sqft_lot          0
floors            0
waterfront        0
view              0
condition         0
sqft_above        0
sqft_basement     0
yr_built          0
yr_renovated      0
street            0
city              0
statezip          0
country           0
dtype: int64

In [18]:
# print("-- Number of Null Values in Data --")
print(df['street'].isnull().sum())

0

In [17]:
# # For Object/String Types
# df['street']   = df['street'].fillna(df['street'].mode()[0])
# df['city']     = df['city'].fillna(df['city'].mode()[0])
# df['statezip'] = df['statezip'].fillna(df['statezip'].mode()[0])
# df['country']  = df['country'].fillna(df['country'].mode()[0])

In [19]:
def fillNaObjMode(col):
    for i in col:
        df[i] = df[i].fillna(df[i].mode()[0])

columns = ['street', 'city', 'statezip', 'country']
fillNaObjMode(columns)

In [20]:
def fillNaMean(col):
    for i in col:
        df[i] = df[i].fillna(df[i].mean())

columns = ['price','sqft_living','sqft_lot','sqft_above','sqft_basement']
fillNaMean(columns)

In [21]:
def fillNaMode(col):
    for i in col:
        df[i] = df[i].fillna(df[i].mode()[0])

columns = ['bedrooms','bathrooms','floors','waterfront','view','yr_built']
fillNaMode(columns)

In [22]:
df.drop('date', axis=1, inplace=True)
df.drop('street', axis=1, inplace=True)

In [23]:
df.head(2)

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,city,statezip,country
0,551658.561135,3,2.5,1340,7912,1.5,12,0,3,1340,0,1955,2005,Shoreline,WA 98133,USA
1,551658.561135,5,2.5,3650,9050,2.0,12,4,5,3370,280,1921,0,Seattle,WA 98119,USA

In [24]:
print(df.isnull().sum())

price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
city             0
statezip         0
country          0
dtype: int64

In [25]:
# df['price'] = df['price'].astype('int64')
def changetoint64(col):
    for i in col:
        df[i] = df[i].astype('int64')
        
columns =[
    'price','bedrooms','bathrooms','sqft_living','sqft_lot',
    'floors','waterfront','view','sqft_above','sqft_basement',
    'yr_built']
changetoint64(columns)

In [26]:
print("Insights of Data".center(50, "-"))
df.info()

-----------------Insights of Data-----------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   int64
 1   bedrooms       4600 non-null   int64
 2   bathrooms      4600 non-null   int64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   int64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  yr_built       4600 non-null   int64
 12  yr_renovated   4600 non-null   int64
 13  city           4600 non-null   object
 14  statezip       4600 non-null   object
 15  country        4600 non-null   object
dtypes: int64(13), object(3)
memory usage: 575.1+ KB

In [26]:
# def fillNaObjMode(col):
#     for i in col:
#         df[i] = df[i].fillna(df[i].mode()[0])

# columns = ['street', 'city', 'statezip', 'country']
# fillNaObjMode(columns)

In [27]:
# df['street'].nunique()

In [27]:
df['city'].unique()

array(['Shoreline', 'Seattle', 'Kent', 'Bellevue', 'Redmond',
       'Maple Valley', 'North Bend', 'Lake Forest Park', 'Sammamish',
       'Auburn', 'Des Moines', 'Bothell', 'Federal Way', 'Kirkland',
       'Issaquah', 'Woodinville', 'Normandy Park', 'Fall City', 'Renton',
       'Carnation', 'Snoqualmie', 'Duvall', 'Burien', 'Covington',
       'Inglewood-Finn Hill', 'Kenmore', 'Newcastle', 'Mercer Island',
       'Black Diamond', 'Ravensdale', 'Clyde Hill', 'Algona', 'Skykomish',
       'Tukwila', 'Vashon', 'Yarrow Point', 'SeaTac', 'Medina',
       'Enumclaw', 'Snoqualmie Pass', 'Pacific', 'Beaux Arts Village',
       'Preston', 'Milton'], dtype=object)

In [28]:
df['statezip'].unique()

array(['WA 98133', 'WA 98119', 'WA 98042', 'WA 98008', 'WA 98052',
       'WA 98115', 'WA 98038', 'WA 98045', 'WA 98155', 'WA 98105',
       'WA 98074', 'WA 98106', 'WA 98007', 'WA 98092', 'WA 98198',
       'WA 98006', 'WA 98102', 'WA 98011', 'WA 98125', 'WA 98003',
       'WA 98136', 'WA 98033', 'WA 98029', 'WA 98117', 'WA 98034',
       'WA 98072', 'WA 98023', 'WA 98107', 'WA 98166', 'WA 98116',
       'WA 98024', 'WA 98055', 'WA 98077', 'WA 98027', 'WA 98059',
       'WA 98075', 'WA 98014', 'WA 98065', 'WA 98199', 'WA 98053',
       'WA 98058', 'WA 98122', 'WA 98103', 'WA 98112', 'WA 98005',
       'WA 98118', 'WA 98177', 'WA 98004', 'WA 98019', 'WA 98144',
       'WA 98168', 'WA 98001', 'WA 98056', 'WA 98146', 'WA 98028',
       'WA 98148', 'WA 98057', 'WA 98040', 'WA 98010', 'WA 98051',
       'WA 98031', 'WA 98109', 'WA 98030', 'WA 98126', 'WA 98032',
       'WA 98178', 'WA 98288', 'WA 98108', 'WA 98070', 'WA 98188',
       'WA 98002', 'WA 98039', 'WA 98022', 'WA 98068', 'WA 98047',
       'WA 98050', 'WA 98354'], dtype=object)

In [29]:
df['country'].unique()

array(['USA'], dtype=object)

In [30]:
df_encoded = df.copy()

In [31]:
def encodeCols(cols):
    for i in cols:
        data = pd.DataFrame({i:df[i].unique()})
        data_label_encoder = LabelEncoder()
        data_label_encoder.fit(np.ravel(data))
        df_encoded[i] = data_label_encoder.transform(df[i]) 

columns = ['city','statezip','country']
encodeCols(columns)

In [33]:
# # Labels
# country = pd.DataFrame({'country':df['country'].unique()})

# # Initializing Label Encoders
# country_label_encoder = LabelEncoder()

# # Training Label Encoder
# country_label_encoder.fit(np.ravel(country))

In [34]:
# df_encoded['country'] = country_label_encoder.transform(df['country'])

In [32]:
# All the Attributes are Numerical 
df_encoded.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   int64
 1   bedrooms       4600 non-null   int64
 2   bathrooms      4600 non-null   int64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   int64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  yr_built       4600 non-null   int64
 12  yr_renovated   4600 non-null   int64
 13  city           4600 non-null   int32
 14  statezip       4600 non-null   int32
 15  country        4600 non-null   int32
dtypes: int32(3), int64(13)
memory usage: 521.2 KB

In [33]:
df_encoded.to_csv(r'encoded-data.csv', index = False, header = True)

# Train-Test Splitting

In [34]:
traindata, testdata = train_test_split(df_encoded, test_size=0.2, shuffle=False)

In [35]:
traindata.head(2)

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,city,statezip,country
0,551658,3,2,1340,7912,1,12,0,3,1340,0,1955,2005,36,62,0
1,551658,5,2,3650,9050,2,12,4,5,3370,280,1921,0,35,58,0

In [36]:
testdata.head(2)

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,city,statezip,country
3680,500000,4,3,3720,15048,3,0,0,3,3720,0,1979,2014,32,37,0
3681,570000,3,2,1890,29185,1,0,0,3,1470,420,1949,2013,3,5,0

In [40]:
# X = df_encoded.drop('price', axis=1)
# y = df_encoded['price']

In [37]:
train_x = traindata.iloc[:, 1:]
train_x.head()

,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,city,statezip,country
0,3,2,1340,7912,1,12,0,3,1340,0,1955,2005,36,62,0
1,5,2,3650,9050,2,12,4,5,3370,280,1921,0,35,58,0
2,3,2,1930,11947,1,12,0,4,1930,0,1966,0,18,26,0
3,3,2,2000,8030,1,12,0,4,1000,1000,1963,0,3,7,0
4,4,2,1940,10500,1,12,0,4,1140,800,1976,1992,31,31,0

In [47]:
train_y = traindata.iloc[:, 0]
train_y.head()

0    551658
1    551658
2    342000
3    551658
4    550000
Name: price, dtype: int64

In [38]:
test_x = testdata.iloc[:, 1:]
test_x.head()

,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,city,statezip,country
3680,4,3,3720,15048,3,0,0,3,3720,0,1979,2014,32,37,0
3681,3,2,1890,29185,1,0,0,3,1470,420,1949,2013,3,5,0
3682,4,2,2680,12215,1,1,4,3,1590,1090,1956,2001,26,68,0
3683,3,2,1460,1613,2,0,0,3,1180,280,2007,0,35,56,0
3684,3,2,3180,7904,1,0,0,3,1810,1370,2006,0,32,34,0

In [39]:
test_y = testdata.iloc[:, 0]
test_y.head()

3680     500000
3681     570000
3682    1309500
3683     544000
3684     439000
Name: price, dtype: int64

# Training Model Using Support Vector Classifier

In [48]:
print("Training using SVC on Training Data".center(50, "-"))
print("-- Parameters & Values: ", end='')

model_svc = SVC(gamma='auto', random_state=0)
model_svc.fit(train_x, train_y)

print(model_svc)

-------Training using SVC on Training Data--------
-- Parameters & Values: SVC(gamma='auto', random_state=0)

In [49]:
# Saving Trained Model
pickle.dump(model_svc, open('model_svc.pkl', 'wb'))

In [50]:
# Load saved Model
model = pickle.load(open('model_svc.pkl', 'rb'))

In [51]:
model_predictions = model.predict(test_x)

testdata_predict = testdata.copy(deep=True)
pd.options.mode.chained_assignment = None

testdata_predict['Prediction'] = model_predictions

In [52]:
# Printing Testing Data
print("Testing Data with Prediction".center(50, "-"))
# pd.set_option("display.max_rows", None, "display.max_columns", None)
# testdata_predict

-----------Testing Data with Prediction-----------

In [53]:
model_accuracy_score = accuracy_score(testdata_predict['price'], testdata_predict['Prediction'])

print("-- Model Accuracy Score: ", end='')
print(round(model_accuracy_score,3))

-- Model Accuracy Score: 0.013

# SVM Classifier

In [54]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix

In [55]:
df = pd.DataFrame({  # Example DataFrame; replace this with your actual dataset
    'feature1': [1, 2, 3, 4, 5, 6],
    'feature2': [2, 3, 4, 5, 6, 7],
    'target': [0, 1, 0, 1, 0, 1]
})

In [56]:
# Step 3: Define features (X) and target (y)
X = df.drop(columns=['target'])  # Replace 'target' with the name of your target column
y = df['target']                # Replace 'target' with the name of your target column

In [57]:
# Step 4: Split the data into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [58]:
# Step 5: Initialize the SVM Classifier
svm_classifier = SVC(kernel='linear')

In [59]:
# Step 6: Train the classifier
svm_classifier.fit(X_train, y_train)

SVC(kernel='linear')

In [60]:
# Step 7: Make predictions
y_pred = svm_classifier.predict(X_test)

In [60]:
# Step 8: Evaluate the model
print("Accuracy:", accuracy_score(y_test, y_pred))
print("\nClassification Report:\n", classification_report(y_test, y_pred))
print("\nConfusion Matrix:\n", confusion_matrix(y_test, y_pred))

Accuracy: 0.5

Classification Report:
               precision    recall  f1-score   support

           0       0.50      1.00      0.67         1
           1       0.00      0.00      0.00         1

    accuracy                           0.50         2
   macro avg       0.25      0.50      0.33         2
weighted avg       0.25      0.50      0.33         2


Confusion Matrix:
 [[1 0]
 [1 0]]

c:\Users\marya\anaconda3\Lib\site-packages\sklearn\metrics\_classification.py:1469: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
c:\Users\marya\anaconda3\Lib\site-packages\sklearn\metrics\_classification.py:1469: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
c:\Users\marya\anaconda3\Lib\site-packages\sklearn\metrics\_classification.py:1469: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

## Splitting by Cell Type

### Number of Code Cells: 62

### Number of Markdown Cells: 10

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Lab 11</title>
</head>
<body style="background-color: #fffbcc;"> <!-- Bright background -->
    <h1 style="color: #ff5733;">LAB 11</h1> <!-- Bright orange text -->
    <h3 style="color: #3498db;">Name: Maryam Sharif</h3> <!-- Bright blue text -->
    <h3 style="color: #2ecc71;">Rollnumber: BSDSM-F23-038</h3> <!-- Bright green text -->
</body>
</html>